samples/qes-cases/HBA-gueltig-bis-24.4.2021/normal/OhneRevocationInfo/85d581e4-0153-4899-9bfa-f78d36ad8d82_S_SECUN_secu_kon_4.8.2_4.1.3_V_RISEG_RKONN_4.8.1_3.0.7_req.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:m0="http://ws.gematik.de/conn/ConnectorContext/v2.0" xmlns:m1="http://ws.gematik.de/conn/ConnectorCommon/v5.0" xmlns:m2="urn:oasis:names:tc:dss:1.0:core:schema" xmlns:m3="http://www.w3.org/2000/09/xmldsig#" xmlns:m4="urn:oasis:names:tc:dss-x:1.0:profiles:verificationreport:schema#">
  <SOAP-ENV:Body>
    <m:VerifyDocument xmlns:m="http://ws.gematik.de/conn/SignatureService/v7.4">
      <m0:Context>
        <m1:MandantId>Mandant1</m1:MandantId>
        <m1:ClientSystemId>ClientID1</m1:ClientSystemId>
        <m1:WorkplaceId>CATS</m1:WorkplaceId>
      </m0:Context>
      <m:TvMode>NONE</m:TvMode>
      <m:OptionalInputs>
        <m:UseVerificationTime>
          <m2:SpecificTime>2021-04-20T13:26:16+02:00</m2:SpecificTime>
        </m:UseVerificationTime>
        <m4:ReturnVerificationReport>
          <m4:IncludeVerifier>true</m4:IncludeVerifier>
          <m4:IncludeCertificateValues>true</m4:IncludeCertificateValues>
          <m4:IncludeRevocationValues>true</m4:IncludeRevocationValues>
          <m4:ExpandBinaryValues>false</m4:ExpandBinaryValues>
        </m4:ReturnVerificationReport>
      </m:OptionalInputs>
      <m2:SignatureObject>
        <m2:Base64Signature Type="urn:ietf:rfc:5652">
          MIIpZAYJKoZIhvcNAQcCoIIpVTCCKVECAQExDzANBglghkgBZQMEAgEFADCCIPMGCSqGSIb3DQEH
AaCCIOQEgiDgPEJ1bmRsZSB4bWxucz0iaHR0cDovL2hsNy5vcmcvZmhpciI+DQogIDwhLS0gQmVp
c3BpZWwtQnVuZGxlIEZyZWl0ZXh0dmVyb3JkbnVuZyBhbHMgU3ByZWNoc3R1bmRlbmJlZGFyZiAt
LT4NCiAgPGlkIHZhbHVlPSI4NWQ1ODFlNC0wMTUzLTQ4OTktOWJmYS1mNzhkMzZhZDhkODIiIC8+
DQogIDxtZXRhPg0KICAgIDxsYXN0VXBkYXRlZCB2YWx1ZT0iMjAyMC0wNS0wNFQwODozMDowMFoi
IC8+DQogICAgPHByb2ZpbGUgdmFsdWU9Imh0dHBzOi8vZmhpci5rYnYuZGUvU3RydWN0dXJlRGVm
aW5pdGlvbi9LQlZfUFJfRVJQX0J1bmRsZXwxLjAuMSIgLz4NCiAgPC9tZXRhPg0KICA8aWRlbnRp
Zmllcj4NCiAgICA8c3lzdGVtIHZhbHVlPSJodHRwczovL2dlbWF0aWsuZGUvZmhpci9OYW1pbmdT
eXN0ZW0vUHJlc2NyaXB0aW9uSUQiIC8+DQogICAgPHZhbHVlIHZhbHVlPSIxNjAuMTIzLjQ1Ni43
ODkuMTIzLjU4IiAvPg0KICA8L2lkZW50aWZpZXI+DQogIDx0eXBlIHZhbHVlPSJkb2N1bWVudCIg
Lz4NCiAgPHRpbWVzdGFtcCB2YWx1ZT0iMjAyMC0wNS0wNFQwODozMDowMFoiIC8+DQogIDxlbnRy
eT4NCiAgICA8ZnVsbFVybCB2YWx1ZT0iaHR0cDovL3B2cy5wcmF4aXMtdG9wcC1nbHVlY2tsaWNo
LmxvY2FsL2ZoaXIvQ29tcG9zaXRpb24vZjk2NWNiNzEtYjNlOS00YWI2LTkyMDktMzMzZjM5ZGEz
YjIwIiAvPg0KICAgIDxyZXNvdXJjZT4NCiAgICAgIDxDb21wb3NpdGlvbiB4bWxucz0iaHR0cDov
L2hsNy5vcmcvZmhpciI+DQogICAgICAgIDxpZCB2YWx1ZT0iZjk2NWNiNzEtYjNlOS00YWI2LTky
MDktMzMzZjM5ZGEzYjIwIiAvPg0KICAgICAgICA8bWV0YT4NCiAgICAgICAgICA8cHJvZmlsZSB2
YWx1ZT0iaHR0cHM6Ly9maGlyLmtidi5kZS9TdHJ1Y3R1cmVEZWZpbml0aW9uL0tCVl9QUl9FUlBf
Q29tcG9zaXRpb258MS4wLjEiIC8+DQogICAgICAgIDwvbWV0YT4NCiAgICAgICAgPHN0YXR1cyB2
YWx1ZT0iZmluYWwiIC8+DQogICAgICAgIDx0eXBlPg0KICAgICAgICAgIDxjb2Rpbmc+DQogICAg
ICAgICAgICA8c3lzdGVtIHZhbHVlPSJodHRwczovL2ZoaXIua2J2LmRlL0NvZGVTeXN0ZW0vS0JW
X0NTX1NGSElSX0tCVl9GT1JNVUxBUl9BUlQiIC8+DQogICAgICAgICAgICA8Y29kZSB2YWx1ZT0i
ZTE2QSIgLz4NCiAgICAgICAgICA8L2NvZGluZz4NCiAgICAgICAgPC90eXBlPg0KICAgICAgICA8
ZGF0ZSB2YWx1ZT0iMjAyMC0wNS0wNFQwODowMDowMFoiIC8+DQogICAgICAgIDxhdXRob3I+DQog
ICAgICAgICAgPHJlZmVyZW5jZSB2YWx1ZT0iUHJhY3RpdGlvbmVyLzIwNTk3ZTBlLWNiMmEtNDVi
My05NWYwLWRjM2RiZGI2MTdjMyIgLz4NCiAgICAgICAgICA8dHlwZSB2YWx1ZT0iUHJhY3RpdGlv
bmVyIiAvPg0KICAgICAgICA8L2F1dGhvcj4NCiAgICAgICAgPGF1dGhvcj4NCiAgICAgICAgICA8
dHlwZSB2YWx1ZT0iRGV2aWNlIiAvPg0KICAgICAgICAgIDxpZGVudGlmaWVyPg0KICAgICAgICAg
ICAgPHN5c3RlbSB2YWx1ZT0iaHR0cHM6Ly9maGlyLmtidi5kZS9OYW1pbmdTeXN0ZW0vS0JWX05T
X0ZPUl9QcnVlZm51bW1lciIgLz4NCiAgICAgICAgICAgIDx2YWx1ZSB2YWx1ZT0iWS80MDAvMTkx
MC8zNi8zNDYiIC8+DQogICAgICAgICAgPC9pZGVudGlmaWVyPg0KICAgICAgICA8L2F1dGhvcj4N
CiAgICAgICAgPHRpdGxlIHZhbHVlPSJlbGVrdHJvbmlzY2hlIEFyem5laW1pdHRlbHZlcm9yZG51
bmciIC8+DQogICAgICAgIDxjdXN0b2RpYW4+DQogICAgICAgICAgPHJlZmVyZW5jZSB2YWx1ZT0i
T3JnYW5pemF0aW9uL2NmMDQyZTQ0LTA4NmEtNGQ1MS05Yzc3LTE3MmY5YTk3MmUzYiIgLz4NCiAg
ICAgICAgPC9jdXN0b2RpYW4+DQogICAgICAgIDxzZWN0aW9uPg0KICAgICAgICAgIDxjb2RlPg0K
ICAgICAgICAgICAgPGNvZGluZz4NCiAgICAgICAgICAgICAgPHN5c3RlbSB2YWx1ZT0iaHR0cHM6
Ly9maGlyLmtidi5kZS9Db2RlU3lzdGVtL0tCVl9DU19FUlBfU2VjdGlvbl9UeXBlIiAvPg0KICAg
ICAgICAgICAgICA8Y29kZSB2YWx1ZT0iUHJhY3RpY2VTdXBwbHkiIC8+DQogICAgICAgICAgICA8
L2NvZGluZz4NCiAgICAgICAgICA8L2NvZGU+DQogICAgICAgICAgPGVudHJ5Pg0KICAgICAgICAg
ICAgPCEtLSBSZWZlcmVueiBhdWYgVmVyb3JkbnVuZyAoU3VwcGx5UmVxdWVzdCkgLS0+DQogICAg
ICAgICAgICA8cmVmZXJlbmNlIHZhbHVlPSJTdXBwbHlSZXF1ZXN0LzNkZDU0Yjc4LTY1ZTItNGFj
Mi04ZTY1LTY2Yjc2OWFkMWQ5NSIgLz4NCiAgICAgICAgICA8L2VudHJ5Pg0KICAgICAgICA8L3Nl
Y3Rpb24+DQogICAgICA8L0NvbXBvc2l0aW9uPg0KICAgIDwvcmVzb3VyY2U+DQogIDwvZW50cnk+
DQogIDxlbnRyeT4NCiAgICA8ZnVsbFVybCB2YWx1ZT0iaHR0cDovL3B2cy5wcmF4aXMtdG9wcC1n
bHVlY2tsaWNoLmxvY2FsL2ZoaXIvU3VwcGx5UmVxdWVzdC8zZGQ1NGI3OC02NWUyLTRhYzItOGU2
NS02NmI3NjlhZDFkOTUiIC8+DQogICAgPHJlc291cmNlPg0KICAgICAgPFN1cHBseVJlcXVlc3Qg
eG1sbnM9Imh0dHA6Ly9obDcub3JnL2ZoaXIiPg0KICAgICAgICA8aWQgdmFsdWU9IjNkZDU0Yjc4
LTY1ZTItNGFjMi04ZTY1LTY2Yjc2OWFkMWQ5NSIgLz4NCiAgICAgICAgPG1ldGE+DQogICAgICAg
ICAgPHByb2ZpbGUgdmFsdWU9Imh0dHBzOi8vZmhpci5rYnYuZGUvU3RydWN0dXJlRGVmaW5pdGlv
bi9LQlZfUFJfRVJQX1ByYWN0aWNlU3VwcGx5fDEuMC4xIiAvPg0KICAgICAgICA8L21ldGE+DQog
ICAgICAgIDxleHRlbnNpb24gdXJsPSJodHRwczovL2ZoaXIua2J2LmRlL1N0cnVjdHVyZURlZmlu
aXRpb24vS0JWX0VYX0VSUF9QcmFjdGljZVN1cHBseV9QYXlvciI+DQogICAgICAgICAgPGV4dGVu
c2lvbiB1cmw9ImlrIj4NCiAgICAgICAgICAgIDx2YWx1ZUlkZW50aWZpZXI+DQogICAgICAgICAg
ICAgIDxzeXN0ZW0gdmFsdWU9Imh0dHA6Ly9maGlyLmRlL05hbWluZ1N5c3RlbS9hcmdlLWlrL2lr
bnIiIC8+DQogICAgICAgICAgICAgIDx2YWx1ZSB2YWx1ZT0iMTIzNDU2Nzg5IiAvPg0KICAgICAg
ICAgICAgPC92YWx1ZUlkZW50aWZpZXI+DQogICAgICAgICAgPC9leHRlbnNpb24+DQogICAgICAg
ICAgPGV4dGVuc2lvbiB1cmw9Im5hbWUiPg0KICAgICAgICAgICAgPHZhbHVlU3RyaW5nIHZhbHVl
PSJEdW1teS1Lb3N0ZW50csSCwqRnZXIiIC8+DQogICAgICAgICAgPC9leHRlbnNpb24+DQogICAg
ICAgICAgPGV4dGVuc2lvbiB1cmw9Imtvc3RlbnRyYWVnZXJ0eXAiPg0KICAgICAgICAgICAgPHZh
bHVlQ29kaW5nPg0KICAgICAgICAgICAgICA8c3lzdGVtIHZhbHVlPSJodHRwOi8vZmhpci5kZS9D
b2RlU3lzdGVtL3ZlcnNpY2hlcnVuZ3NhcnQtZGUtYmFzaXMiIC8+DQogICAgICAgICAgICAgIDxj
b2RlIHZhbHVlPSJHS1YiIC8+DQogICAgICAgICAgICA8L3ZhbHVlQ29kaW5nPg0KICAgICAgICAg
IDwvZXh0ZW5zaW9uPg0KICAgICAgICA8L2V4dGVuc2lvbj4NCiAgICAgICAgPGl0ZW1SZWZlcmVu
Y2U+DQogICAgICAgICAgPHJlZmVyZW5jZSB2YWx1ZT0iTWVkaWNhdGlvbi9hMDU1M2FkNS01NmJj
LTQ0NmMtOTFkZS03MGYwMjYwYjRlN2EiIC8+DQogICAgICAgIDwvaXRlbVJlZmVyZW5jZT4NCiAg
ICAgICAgPHF1YW50aXR5Pg0KICAgICAgICAgIDx2YWx1ZSB2YWx1ZT0iMSIgLz4NCiAgICAgICAg
ICA8c3lzdGVtIHZhbHVlPSJodHRwOi8vdW5pdHNvZm1lYXN1cmUub3JnIiAvPg0KICAgICAgICAg
IDxjb2RlIHZhbHVlPSJ7UGFja2FnZX0iIC8+DQogICAgICAgIDwvcXVhbnRpdHk+DQogICAgICAg
IDxhdXRob3JlZE9uIHZhbHVlPSIyMDIwLTAyLTIwIiAvPg0KICAgICAgICA8cmVxdWVzdGVyPg0K
ICAgICAgICAgIDxyZWZlcmVuY2UgdmFsdWU9IlByYWN0aXRpb25lci8yMDU5N2UwZS1jYjJhLTQ1
YjMtOTVmMC1kYzNkYmRiNjE3YzMiIC8+DQogICAgICAgIDwvcmVxdWVzdGVyPg0KICAgICAgPC9T
dXBwbHlSZXF1ZXN0Pg0KICAgIDwvcmVzb3VyY2U+DQogIDwvZW50cnk+DQogIDxlbnRyeT4NCiAg
ICA8ZnVsbFVybCB2YWx1ZT0iaHR0cDovL3B2cy5wcmF4aXMtdG9wcC1nbHVlY2tsaWNoLmxvY2Fs
L2ZoaXIvTWVkaWNhdGlvbi9hMDU1M2FkNS01NmJjLTQ0NmMtOTFkZS03MGYwMjYwYjRlN2EiIC8+
DQogICAgPHJlc291cmNlPg0KICAgICAgPE1lZGljYXRpb24geG1sbnM9Imh0dHA6Ly9obDcub3Jn
L2ZoaXIiPg0KICAgICAgICA8aWQgdmFsdWU9ImEwNTUzYWQ1LTU2YmMtNDQ2Yy05MWRlLTcwZjAy
NjBiNGU3YSIgLz4NCiAgICAgICAgPG1ldGE+DQogICAgICAgICAgPHByb2ZpbGUgdmFsdWU9Imh0
dHBzOi8vZmhpci5rYnYuZGUvU3RydWN0dXJlRGVmaW5pdGlvbi9LQlZfUFJfRVJQX01lZGljYXRp
b25fRnJlZVRleHR8MS4wLjEiIC8+DQogICAgICAgIDwvbWV0YT4NCiAgICAgICAgPGV4dGVuc2lv
biB1cmw9Imh0dHBzOi8vZmhpci5rYnYuZGUvU3RydWN0dXJlRGVmaW5pdGlvbi9LQlZfRVhfRVJQ
X01lZGljYXRpb25fQ2F0ZWdvcnkiPg0KICAgICAgICAgIDx2YWx1ZUNvZGluZz4NCiAgICAgICAg
ICAgIDxzeXN0ZW0gdmFsdWU9Imh0dHBzOi8vZmhpci5rYnYuZGUvQ29kZVN5c3RlbS9LQlZfQ1Nf
RVJQX01lZGljYXRpb25fQ2F0ZWdvcnkiIC8+DQogICAgICAgICAgICA8Y29kZSB2YWx1ZT0iMDAi
IC8+DQogICAgICAgICAgPC92YWx1ZUNvZGluZz4NCiAgICAgICAgPC9leHRlbnNpb24+DQogICAg
ICAgIDxleHRlbnNpb24gdXJsPSJodHRwczovL2ZoaXIua2J2LmRlL1N0cnVjdHVyZURlZmluaXRp
b24vS0JWX0VYX0VSUF9NZWRpY2F0aW9uX1ZhY2NpbmUiPg0KICAgICAgICAgIDx2YWx1ZUJvb2xl
YW4gdmFsdWU9InRydWUiIC8+DQogICAgICAgIDwvZXh0ZW5zaW9uPg0KICAgICAgICA8Y29kZT4N
CiAgICAgICAgICA8Y29kaW5nPg0KICAgICAgICAgICAgPHN5c3RlbSB2YWx1ZT0iaHR0cHM6Ly9m
aGlyLmtidi5kZS9Db2RlU3lzdGVtL0tCVl9DU19FUlBfTWVkaWNhdGlvbl9UeXBlIiAvPg0KICAg
ICAgICAgICAgPGNvZGUgdmFsdWU9ImZyZWl0ZXh0IiAvPg0KICAgICAgICAgIDwvY29kaW5nPg0K
ICAgICAgICAgIDx0ZXh0IHZhbHVlPSJEdW1teS1JbXBmc3RvZmYgYWxzIEZyZWl0ZXh0IiAvPg0K
ICAgICAgICA8L2NvZGU+DQogICAgICA8L01lZGljYXRpb24+DQogICAgPC9yZXNvdXJjZT4NCiAg
PC9lbnRyeT4NCiAgPGVudHJ5Pg0KICAgIDxmdWxsVXJsIHZhbHVlPSJodHRwOi8vcHZzLnByYXhp
cy10b3BwLWdsdWVja2xpY2gubG9jYWwvZmhpci9QcmFjdGl0aW9uZXIvMjA1OTdlMGUtY2IyYS00
NWIzLTk1ZjAtZGMzZGJkYjYxN2MzIiAvPg0KICAgIDxyZXNvdXJjZT4NCiAgICAgIDxQcmFjdGl0
aW9uZXIgeG1sbnM9Imh0dHA6Ly9obDcub3JnL2ZoaXIiPg0KICAgICAgICA8aWQgdmFsdWU9IjIw
NTk3ZTBlLWNiMmEtNDViMy05NWYwLWRjM2RiZGI2MTdjMyIgLz4NCiAgICAgICAgPG1ldGE+DQog
ICAgICAgICAgPHByb2ZpbGUgdmFsdWU9Imh0dHBzOi8vZmhpci5rYnYuZGUvU3RydWN0dXJlRGVm
aW5pdGlvbi9LQlZfUFJfRk9SX1ByYWN0aXRpb25lcnwxLjAuMyIgLz4NCiAgICAgICAgPC9tZXRh
Pg0KICAgICAgICA8aWRlbnRpZmllcj4NCiAgICAgICAgICA8dHlwZT4NCiAgICAgICAgICAgIDxj
b2Rpbmc+DQogICAgICAgICAgICAgIDxzeXN0ZW0gdmFsdWU9Imh0dHA6Ly90ZXJtaW5vbG9neS5o
bDcub3JnL0NvZGVTeXN0ZW0vdjItMDIwMyIgLz4NCiAgICAgICAgICAgICAgPGNvZGUgdmFsdWU9
IkxBTlIiIC8+DQogICAgICAgICAgICA8L2NvZGluZz4NCiAgICAgICAgICA8L3R5cGU+DQogICAg
ICAgICAgPHN5c3RlbSB2YWx1ZT0iaHR0cHM6Ly9maGlyLmtidi5kZS9OYW1pbmdTeXN0ZW0vS0JW
X05TX0Jhc2VfQU5SIiAvPg0KICAgICAgICAgIDx2YWx1ZSB2YWx1ZT0iODM4MzgyMjAyIiAvPg0K
ICAgICAgICA8L2lkZW50aWZpZXI+DQogICAgICAgIDxuYW1lPg0KICAgICAgICAgIDx1c2UgdmFs
dWU9Im9mZmljaWFsIiAvPg0KICAgICAgICAgIDxmYW1pbHkgdmFsdWU9IlRvcHAtR2zDvGNrbGlj
aCI+DQogICAgICAgICAgICA8ZXh0ZW5zaW9uIHVybD0iaHR0cDovL2hsNy5vcmcvZmhpci9TdHJ1
Y3R1cmVEZWZpbml0aW9uL2h1bWFubmFtZS1vd24tbmFtZSI+DQogICAgICAgICAgICAgIDx2YWx1
ZVN0cmluZyB2YWx1ZT0iVG9wcC1HbMO8Y2tsaWNoIiAvPg0KICAgICAgICAgICAgPC9leHRlbnNp
b24+DQogICAgICAgICAgPC9mYW1pbHk+DQogICAgICAgICAgPGdpdmVuIHZhbHVlPSJIYW5zIiAv
Pg0KICAgICAgICAgIDxwcmVmaXggdmFsdWU9IkRyLiBtZWQuIj4NCiAgICAgICAgICAgIDxleHRl
bnNpb24gdXJsPSJodHRwOi8vaGw3Lm9yZy9maGlyL1N0cnVjdHVyZURlZmluaXRpb24vaXNvMjEw
OTAtRU4tcXVhbGlmaWVyIj4NCiAgICAgICAgICAgICAgPHZhbHVlQ29kZSB2YWx1ZT0iQUMiIC8+
DQogICAgICAgICAgICA8L2V4dGVuc2lvbj4NCiAgICAgICAgICA8L3ByZWZpeD4NCiAgICAgICAg
PC9uYW1lPg0KICAgICAgICA8cXVhbGlmaWNhdGlvbj4NCiAgICAgICAgICA8Y29kZT4NCiAgICAg
ICAgICAgIDxjb2Rpbmc+DQogICAgICAgICAgICAgIDxzeXN0ZW0gdmFsdWU9Imh0dHBzOi8vZmhp
ci5rYnYuZGUvQ29kZVN5c3RlbS9LQlZfQ1NfRk9SX1F1YWxpZmljYXRpb25fVHlwZSIgLz4NCiAg
ICAgICAgICAgICAgPGNvZGUgdmFsdWU9IjAwIiAvPg0KICAgICAgICAgICAgPC9jb2Rpbmc+DQog
ICAgICAgICAgPC9jb2RlPg0KICAgICAgICA8L3F1YWxpZmljYXRpb24+DQogICAgICAgIDxxdWFs
aWZpY2F0aW9uPg0KICAgICAgICAgIDxjb2RlPg0KICAgICAgICAgICAgPHRleHQgdmFsdWU9Ikhh
dXNhcnp0IiAvPg0KICAgICAgICAgIDwvY29kZT4NCiAgICAgICAgPC9xdWFsaWZpY2F0aW9uPg0K
ICAgICAgPC9QcmFjdGl0aW9uZXI+DQogICAgPC9yZXNvdXJjZT4NCiAgPC9lbnRyeT4NCiAgPGVu
dHJ5Pg0KICAgIDxmdWxsVXJsIHZhbHVlPSJodHRwOi8vcHZzLnByYXhpcy10b3BwLWdsdWVja2xp
Y2gubG9jYWwvZmhpci9Pcmdhbml6YXRpb24vY2YwNDJlNDQtMDg2YS00ZDUxLTljNzctMTcyZjlh
OTcyZTNiIiAvPg0KICAgIDxyZXNvdXJjZT4NCiAgICAgIDxPcmdhbml6YXRpb24geG1sbnM9Imh0
dHA6Ly9obDcub3JnL2ZoaXIiPg0KICAgICAgICA8aWQgdmFsdWU9ImNmMDQyZTQ0LTA4NmEtNGQ1
MS05Yzc3LTE3MmY5YTk3MmUzYiIgLz4NCiAgICAgICAgPG1ldGE+DQogICAgICAgICAgPHByb2Zp
bGUgdmFsdWU9Imh0dHBzOi8vZmhpci5rYnYuZGUvU3RydWN0dXJlRGVmaW5pdGlvbi9LQlZfUFJf
Rk9SX09yZ2FuaXphdGlvbnwxLjAuMyIgLz4NCiAgICAgICAgPC9tZXRhPg0KICAgICAgICA8aWRl
bnRpZmllcj4NCiAgICAgICAgICA8dHlwZT4NCiAgICAgICAgICAgIDxjb2Rpbmc+DQogICAgICAg
ICAgICAgIDxzeXN0ZW0gdmFsdWU9Imh0dHA6Ly90ZXJtaW5vbG9neS5obDcub3JnL0NvZGVTeXN0
ZW0vdjItMDIwMyIgLz4NCiAgICAgICAgICAgICAgPGNvZGUgdmFsdWU9IkJTTlIiIC8+DQogICAg
ICAgICAgICA8L2NvZGluZz4NCiAgICAgICAgICA8L3R5cGU+DQogICAgICAgICAgPHN5c3RlbSB2
YWx1ZT0iaHR0cHM6Ly9maGlyLmtidi5kZS9OYW1pbmdTeXN0ZW0vS0JWX05TX0Jhc2VfQlNOUiIg
Lz4NCiAgICAgICAgICA8dmFsdWUgdmFsdWU9IjAzMTIzNDU2NyIgLz4NCiAgICAgICAgPC9pZGVu
dGlmaWVyPg0KICAgICAgICA8bmFtZSB2YWx1ZT0iSGF1c2FyenRwcmF4aXMgRHIuIFRvcHAtR2zD
vGNrbGljaCIgLz4NCiAgICAgICAgPHRlbGVjb20+DQogICAgICAgICAgPHN5c3RlbSB2YWx1ZT0i
cGhvbmUiIC8+DQogICAgICAgICAgPHZhbHVlIHZhbHVlPSIwMzAxMjM0NTY3IiAvPg0KICAgICAg
ICA8L3RlbGVjb20+DQogICAgICAgIDxhZGRyZXNzPg0KICAgICAgICAgIDx0eXBlIHZhbHVlPSJi
b3RoIiAvPg0KICAgICAgICAgIDxsaW5lIHZhbHVlPSJNdXN0ZXJzdHIuIDIiPg0KICAgICAgICAg
ICAgPGV4dGVuc2lvbiB1cmw9Imh0dHA6Ly9obDcub3JnL2ZoaXIvU3RydWN0dXJlRGVmaW5pdGlv
bi9pc28yMTA5MC1BRFhQLWhvdXNlTnVtYmVyIj4NCiAgICAgICAgICAgICAgPHZhbHVlU3RyaW5n
IHZhbHVlPSIyIiAvPg0KICAgICAgICAgICAgPC9leHRlbnNpb24+DQogICAgICAgICAgICA8ZXh0
ZW5zaW9uIHVybD0iaHR0cDovL2hsNy5vcmcvZmhpci9TdHJ1Y3R1cmVEZWZpbml0aW9uL2lzbzIx
MDkwLUFEWFAtc3RyZWV0TmFtZSI+DQogICAgICAgICAgICAgIDx2YWx1ZVN0cmluZyB2YWx1ZT0i
TXVzdGVyc3RyLiIgLz4NCiAgICAgICAgICAgIDwvZXh0ZW5zaW9uPg0KICAgICAgICAgIDwvbGlu
ZT4NCiAgICAgICAgICA8Y2l0eSB2YWx1ZT0iQmVybGluIiAvPg0KICAgICAgICAgIDxwb3N0YWxD
b2RlIHZhbHVlPSIxMDYyMyIgLz4NCiAgICAgICAgPC9hZGRyZXNzPg0KICAgICAgPC9Pcmdhbml6
YXRpb24+DQogICAgPC9yZXNvdXJjZT4NCiAgPC9lbnRyeT4NCjwvQnVuZGxlPqCCBOUwggThMIID
yaADAgECAgYp+RJXSnMwDQYJKoZIhvcNAQELBQAwUDELMAkGA1UEBhMCREUxHzAdBgNVBAoMFmdl
bWF0aWsgR21iSCBOT1QtVkFMSUQxIDAeBgNVBAMMF0dFTS5IQkEtcUNBMjQgVEVTVC1PTkxZMB4X
DTIxMDQyMDAwMDAwMFoXDTIxMDQyNDIzNTk1OVowfDELMAkGA1UEBhMCREUxbTARBgNVBAQMCk5p
Z2dlbWV5ZXIwFwYDVQQqDBBIaWxsYXJ5IEZyZWlmcmF1MBsGA1UEBRMUODAyNzY4ODMxMTAwMDAx
MjkxODQwIgYDVQQDDBtIaWxsYXJ5IE5pZ2dlbWV5ZXJURVNULU9OTFkwggEiMA0GCSqGSIb3DQEB
AQUAA4IBDwAwggEKAoIBAQCvKfDybFteG3okZoCEWNQ0qk5keJhzG61YUdZupfdPS9u/s+6ew6J/
PjmybL0S/o2Dkp33JjY2PUYcAG1DPy18rkwFkFfqB+v2X4AsMbl5/1qDih8VK+Siam9zBOfCYuXA
FyhdFhJESk7dhDQkUUS9myhzfZ2k6soQu5T4zEAP7UHKKFyjk+7EvJ7GUtmrlpiEZHImxiUnKDua
fiRuM+m+ChlICrg8hBg7d8N0lSg8Tqm0qgJQXG++JjmXQRT6tlYtqdzdSOwelGfalD8Qf5qLN961
pMhelzeohbzYgPwA6FfizzQkhLv8e6rvlY22ZU6puuMi/gevbMMy9big1EjFAgMBAAGjggGTMIIB
jzAMBgNVHRMBAf8EAjAAMDgGCCsGAQUFBwEBBCwwKjAoBggrBgEFBQcwAYYcaHR0cDovL2VoY2Eu
Z2VtYXRpay5kZS9vY3NwLzAbBgkrBgEEAcBtAwUEDjAMBgorBgEEAcBtAwUBMCIGCCsGAQUFBwED
BBYwFDAIBgYEAI5GAQEwCAYGBACORgEEMB8GA1UdIwQYMBaAFGecMbbpwDfqHRuB56T1O8weFwE5
MB0GA1UdDgQWBBQ2B9iQvU86iM8APTj28kkkS0seoTAOBgNVHQ8BAf8EBAMCBkAwOQYDVR0gBDIw
MDAJBgcqghQATARIMAkGBwQAi+xAAQIwCgYIKoIUAEwEgREwDAYKKwYBBAGCzTMBATB5BgUrJAgD
AwRwMG6kKDAmMQswCQYDVQQGEwJERTEXMBUGA1UECgwOZ2VtYXRpayBCZXJsaW4wQjBAMD4wPDAO
DAzDhHJ6dGluL0FyenQwCQYHKoIUAEwEHhMfMS1IQkEtVGVzdGthcnRlLTg4MzExMDAwMDEyOTE4
NDANBgkqhkiG9w0BAQsFAAOCAQEAMx+QdAXb+r0EXXxHkxFDTyeU/DDETSpKxbVZUmjiUjvS315i
xaEp2haFDhBqYj5jQgyNng8TJVSrJhIKMkVUklDGbOfzQIt3sgRbarzD8s4gEA2+hirNk/5FA0oo
h61Hg2GL81mAnIVQhWody1nf2AxXBPestEgFutVk6YkRiXJRSzqhYaU8Rl2SjOqbZI7VbC7XjjVO
Opbg2CP2td9q/g+xHa3FEhQP86F6anfzBUw7PGrMzWwHR+qVVthZJUW3FhGU52s5o055BH+pKQbg
asyyO8MntYg59sy7B3wyyqSrhvs+d4OUjM7A7NDX/mwVav4FE+0ChIq+p+nTopTCmjGCA1kwggNV
AgEBMFowUDELMAkGA1UEBhMCREUxHzAdBgNVBAoMFmdlbWF0aWsgR21iSCBOT1QtVkFMSUQxIDAe
BgNVBAMMF0dFTS5IQkEtcUNBMjQgVEVTVC1PTkxZAgYp+RJXSnMwDQYJYIZIAWUDBAIBBQCgggGc
MBgGCSqGSIb3DQEJAzELBgkqhkiG9w0BBwEwHAYJKoZIhvcNAQkFMQ8XDTIxMDQyMDExMjYxNVow
LwYJKoZIhvcNAQkEMSIEIGbT/tlZNXMr/kYfH4faSPO9sXBbi7My2raBaAgbAhmTMDAGCyqGSIb3
DQEJEAIEMSEwHwwSYSBDTVNEb2N1bWVudDJzaWduBgkqhkiG9w0BBwEwYQYJKoZIhvcNAQk0MVQw
UjANBglghkgBZQMEAgEFAKFBBgkqhkiG9w0BAQowNKAPMA0GCWCGSAFlAwQCAQUAoRwwGgYJKoZI
hvcNAQEIMA0GCWCGSAFlAwQCAQUAogMCASAwgZsGCyqGSIb3DQEJEAIvMYGLMIGIMIGFMIGCBCD4
DesP+MSHRP+dgw1FyocL6YpOzQI63qFTODTudJbikjBeMFSkUjBQMQswCQYDVQQGEwJERTEfMB0G
A1UECgwWZ2VtYXRpayBHbWJIIE5PVC1WQUxJRDEgMB4GA1UEAwwXR0VNLkhCQS1xQ0EyNCBURVNU
LU9OTFkCBin5EldKczBBBgkqhkiG9w0BAQowNKAPMA0GCWCGSAFlAwQCAQUAoRwwGgYJKoZIhvcN
AQEIMA0GCWCGSAFlAwQCAQUAogMCASAEggEAEWLYL1n9M9Nsg1haZVgiNFEPUK4eM96eNCacT9bP
AxgtSU7wHTEDBzTeCeLiaA082x+BT8sU/hfRBbdto05eRIA2br6bgm3FZP67AxzfQXttgGv2lRK8
7fGmGGHV81tBcSpqhAI/67UC/GjVr8b80B1siMnh6sWqF7nfhCdGRUsSqHaOelUIOFzxIToR8iRR
DWwSxwG17uKhY8dm8gKa/feBMms2Hoe9xM3dT7/syH5tNulc0doJl196S39mMQlE32SQN1ctncOh
QZK2dx8rTH4Q+iQenLS3awlL6C2g3/HO/ZOSMrkSqHYPJQd8izpFsfAo0moyjwKcrlB3QAdY/Q==

        </m2:Base64Signature>
      </m2:SignatureObject>
      <m:IncludeRevocationInfo>false</m:IncludeRevocationInfo>
    </m:VerifyDocument>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>